app/Controllers/Register.php

    public function index()
    {
        helper(['form']);
        $rules = [
            'email' =>
                'required|valid_email|is_unique[users.email]',
            'password' => 'required|min_length[6]',
            'confpassword' => 'matches[password]',
        ];
        if (!$this->validate($rules)) {
            return $this->fail(
                $this->validator->getErrors()
            );
        }
        $data = [
            'email' => $this->request->getVar('email'),
            'password' => password_hash(
                $this->request->getVar('password'),
                PASSWORD_BCRYPT
            ),
        ];
        $model = new UserModel();
        $registered = $model->save($data);
---
INSERT INTO `users` (`email`, `password`) VALUES ('dancerking306@gmail.com', '$2y$10$iDiL4gSFz4Ci93RyGFbrEeG.zV3wHCTX8sh/mNDky30EpeG4ddcCm')