app/Controllers/User.php

    public function index()
    {
        $users = new UserModel;
        return $this->respond(['users' => $users->findAll()], 200);
---
SELECT *
FROM `users`

    public function show($id = null)
    {
        $model = new UserModel();
        $data = $model->getWhere(['id' => $id])->getResult();
---
SELECT *
FROM `users`
WHERE `id` = '1'

    public function create()
    {
        $model = new UserModel();
        $data = [
            'email' => $this->request->getVar('email'),
            'password' => password_hash($this->request->getVar('password'), PASSWORD_DEFAULT),
            'created_at'    => date("Y-m-d H:i:s"),
            'updated_at'    => date("Y-m-d H:i:s"),
        ];
        $model->insert($data);
---
INSERT INTO `users` (`email`, `password`) VALUES ('Eric@gmail.com', '$2y$10$EQQx.6pdkRp6PIOFUP96xOulphb.wc8jT2lgza4LHWtbxFXyBHk9G')

   public function delete($id = null)
   {
    $model = new UserModel();
    $model->delete($id);
---
DELETE FROM `users`
WHERE `id` IN ('1')